{
  "Diamond钻石哈希娱乐城": "Diamond钻石哈希娱乐城",
  "登錄": "log in",
  "註冊": "register",
  "退出": "quit",
  "退出App": "Exit the app",
  "餘額": "balance",
  "未登入": "not logged in",
  "投注": "bet",
  "賠率": "odds",
  "倍": "",
  "選擇操作語言": "Select operating language",
  "取消": "Cancel",
  "確定": "Sure",
  "歷史中獎": "historical jackpot",
  "全球區塊鏈TRC20-USDT競彩平台": "Global Blockchain TRC20-USDT Lottery Platform",
  "公平，公證，公開": "fair, notarized, public",
  "客服": "customer service",
  "頻道": "channel",
  "Diamond钻石哈希客服": "Diamond钻石哈希客服",
  "Diamond钻石哈希聊天群": "Diamond钻石哈希聊天群",
  "立即投注": "bet now",
  "開獎記錄": "lottery record",
  "關於Diamond钻石哈希娱乐城": "About Diamond钻石哈希娱乐城",
  "基於區塊鏈交易產生的哈希值進行競猜遊戲平台": "A game platform for guessing games based on the hash value generated by blockchain transactions",
  "僅接受USDT": "times only acceptUSDT",
  "玩法介紹": "How to play",
  "本月投注": "Bet of the month",
  "本中獎月": "This winning month",
  "投注數據": "betting data",
  "今日投注": "Bet Today",
  "今日中獎": "Win today",
  "遊戲介紹": "game introduction",
  "遊戲規則": "game rules",
  "其他推薦": "Other recommendations",
  "立即遊戲": "play now",
  "4星推薦": "4star recommendation",
  "邀请好友": "invite friends",
  "查看明细": "View details",
  "投資": "invest",
  "本月投資": "Invest this month",
  "中獎": "winning the lottery",
  "本月中獎": "Winner of the month",
  "推廣數據": "Promotional data",
  "邀請好友參與投注、即可獲得豐厚獎勵": "Invite friends to participate in betting, you can get rich rewards",
  "渠道投注": "channel betting",
  "渠道中獎": "Channel winning",
  "渠道盈利": "channel profit",
  "渠道人數": "Number of channels",
  "關於我們": "about us",
  "查看更多": "see more",
  "我們追求極簡流程快速派彩": "We pursue a minimalist process\\quick payout",
  "今日返傭": "Today's rebate",
  "本月返傭": "this month's rebate",
  "今日反水": "Today's reversal",
  "本月反水": "this month's reversal",
  "資金提現": "Withdrawal of funds",
  "資金明細": "Funding Details",
  "盈利報表": "Profit Statement",
  "設置": "set up",
  "語言設置": "language settings",
  "選擇首選語言": "Select preferred language",
  "安全設置": "Security Settings",
  "設置登入密碼、提現密碼": "Set login password and withdrawal password",
  "投注錢包": "betting wallet",
  "添加、綁定投注錢包地址": "Add and bind betting wallet address",
  "修改錢包地址": "Modify wallet address",
  "錢包地址": "wallet address",
  "TRC20協議": "TRC20 protocol",
  "立即更新": "update immediately",
  "navigation": {
    "home": "home",
    "vip": "member",
    "report": "report",
    "game": "game",
    "control": "control"
  },
  "首頁": {
    "Q1": "Q1: What is a block hash (BIock hash)?",
    "A1": "Blockchain is essentially a shared database in which data or information is stored. It has the characteristics of unforgeability, full traces, traceability, openness and transparency, and collective maintenance.",
    "Q2": "Q2: What is blockchain?",
    "A2": "The block hash value is the DNA of a piece of data, and each block hash value is unique, random and unbreakable.",
    "Q3": "Q3: What is a decentralized wallet? Why is centralized wallet safe?",
    "A3": "Compared with centralized wallets (exchanges) whose private keys are in the hands of third-party service providers, the private keys of decentralized wallets are kept by users themselves, assets are stored on the blockchain, and users are real digital currency holders , the wallet is only a tool to help users manage assets on the chain and read blockchain data, so it is impossible to control, steal, and transfer your assets.",
    "Q4": "Q4: Why do I keep winning or not winning?",
    "A4": "At the same time, random events will follow the law of large numbers (under the condition that the experiment is unchanged, repeat the experiment for many times, the frequency of random events is similar to its probability definition of the law of large numbers), and in the case of increasing frequency of transfers, winning or not winning the lottery will tend to a stable value. So please continue to transfer money. As the frequency of transfers increases, the total probability of winning the lottery will increase.",
    "Q5": "Q5: Why is the account delayed?",
    "A5": "Due to the blockchain technology, in order to ensure the security of funds, multiple calculations, comparisons, and confirmations will be performed. So the calculation speed is slow, but it is expensive in safety.",
    "Q6": "Q6: Which type of USDT should I choose?",
    "A6": "This platform is based on TRON TRC20 technology. Therefore, the transfer address of Lucky Hash belongs to USDT-TRC20, and you should choose USDT-TRC20; if you choose another type, Lucky Hash cannot receive your USDT, which will cause losses to both you and Lucky Hash."
  },
  "控制器.text": "All you need is a [decentralized] digital wallet to participate in the lottery immediately. There are no restrictions on gameplay, strategy, or equipment, anytime, anywhere, whatever you want! The account is automatically credited within 10 seconds after winning the lottery, the game is uninterrupted, and the experience is hearty.",
  "修改錢包地址.hint": "注意!Attention! Fill in the correct betting wallet address, and the bet can be settled immediately after betting, otherwise the lottery will not be drawn because there is no account binding."
}
